//BUILDC1 JOB MSGLEVEL=(1,1),MSGCLASS=A,CLASS=A,
// NOTIFY=&SYSUID
//STEP1 EXEC IGYWCL,REGION=250M
//COBOL.STEPLIB DD DISP=SHR,DSN=SYS1.LINKLIB
//COBOL.SYSIN   DD DISP=SHR,DSN=RAFAELGB.PROGS.COBOL(DFHSAMPL)
//LKED.SYSLMOD  DD DISP=OLD,DSN=RAFAELGB.PROGS.LOADLIB(DFHSAMPL)
