//BUILDD2 JOB MSGLEVEL=(1,1),CLASS=A,MSGCLASS=A,
// NOTIFY=&SYSUID
//MYLIBS1  JCLLIB  ORDER=DFH320.CICS.SDFHPROC
//STEP1 EXEC DFHEITVL
//TRN.SYSIN DD DISP=SHR,DSN=RAFAELGB.PROGS.COBOL(DFHSAMPL)
//LKED.SYSIN DD *
    NAME PROG1(R)
/*
