//KC03G80 JOB MSGLEVEL=(1,1),REGIOM=0M,           
// MSGCLASS=A,CLASS=A,NOTIFY=&SYSUID              
//STEP1 EXEC PGM=IGYWCLG,REGION=250M              
//STEPLIB DD DSN=IGY420.SIGYPROC,DISP=SHR         
//SYSIN DD DISP=SHR,DSN=KC03G80.CHAN.COBOL(PROG1)