//RUNCBL1 JOB MSGLEVEL=(1,1),CLASS=A,MSGCLASS=A,
// NOTIFY=&SYSUID
//STEP1 EXEC PGM=HELLO
//STEPLIB DD DISP=SHR,DSN=RAFAELGB.PROGS.LOADLIB
//SYSOUT  DD SYSOUT=*
