//RUNCBL4 JOB MSGLEVEL=(1,1),CLASS=A,MSGCLASS=A,
// NOTIFY=&SYSUID
//STEP1 EXEC PGM=ACCEPT
//STEPLIB DD DISP=SHR,DSN=RAFAELGB.PROGS.LOADLIB
//SYSOUT  DD SYSOUT=*
//SYSIN   DD *
M
017
/*
