000100  IDENTIFICATION DIVISION.
000200    PROGRAM-ID. ADDNUMS.
000300  DATA DIVISION.
000400    WORKING-STORAGE SECTION.
000500    77 WS-NUM1  PIC 9(2).
000600    77 WS-NUM2  PIC 9(2).
000700    77 WS-RESU  PIC 9(3).
000800    77 WS-LEN   PIC S9(4) COMP.
000900    COPY DFHAID.
001000    COPY DFHBMSCA.
001100    COPY SCREEN1.
001200  PROCEDURE DIVISION.
001300      MOVE LOW-VALUES TO ADDMAPI.
001400      MOVE LOW-VALUES TO ADDMAPO.
001500      EXEC CICS SEND MAP('ADDMAP')
001600                     MAPSET('SCREEN1')
001700                     ERASE
001800      END-EXEC.
001810      MOVE -30 TO WS-LEN
001820      EXEC CICS RECEIVE MAP('ADDMAP')
001830                        MAPSET('SCREEN1')
001840                        INTO(ADDMAPI)
001850      END-EXEC.
001860      MOVE NUM1I TO WS-NUM1.
001870      MOVE NUM2I TO WS-NUM2.
001880      COMPUTE WS-RESU = WS-NUM1 + WS-NUM2.
001890      MOVE WS-RESU TO SUMO.
001891      MOVE 200 TO WS-LEN.
001892      EXEC CICS SEND MAP('ADDMAP')
001893                     MAPSET('SCREEN1')
001894                     FROM(ADDMAPO)
001895      END-EXEC.
001900      EXEC CICS RETURN
002000      END-EXEC.
